EDT/ZUP/zup_edt/src/InformationRegisters/МедицинскиеОсмотрыПоВреднымФакторам/МедицинскиеОсмотрыПоВреднымФакторам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МедицинскиеОсмотрыПоВреднымФакторам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатОсмотра</name>
    <type>
      <types>EnumRef.РезультатыМедицинскогоОсмотра</types>
    </type>
  </resources>
  <attributes>
    <name>Направление</name>
    <type>
      <types>DocumentRef.НаправлениеНаМедицинскийОсмотр</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВредныйФактор</name>
    <type>
      <types>CatalogRef.ВредныеОпасныеПроизводственныеФакторы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/МедицинскиеОсмотрыПоВреднымФакторам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ГоловнаяОрганизация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
